cfd-simulation/tuna/U_0p4/0/omega
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object omega;
}

dimensions [0 0 -1 0 0 0 0];

internalField uniform 10;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 10;
    }

    outlet
    {
        type zeroGradient;
    }

    bottom
    {
        type symmetry;
    }

    top
    {
        type symmetry;
    }

    sideMin
    {
        type symmetry;
    }

    sideMax
    {
        type symmetry;
    }

    fish
    {
        type omegaWallFunction;
        value uniform 10;
    }
}
